# Core CLI tools
brew "awscli"
brew "bat"        # cat clone with syntax highlighting
brew "fd"         # find replacement
brew "fzf"        # fuzzy finder
brew "gh"         # GitHub CLI
brew "go@1.22"    # Go programming language
brew "grpcurl"    # gRPC curl equivalent
brew "lsd"        # ls replacement
brew "neovim"     # Vim-based text editor
brew "ripgrep"    # grep replacement
brew "jq"         # JSON processor
brew "supervisor" # process control system
brew "tmux"       # terminal multiplexer
brew "watch"      # execute a program periodically

# GUI Applications
cask "aerospace"  # tiling window manager
cask "ghostty"    # GPU-accelerated terminal emulator
cask "cursor"     # AI-powered code editor

# Work specific
tap "withgraphite/tap"
brew "graphite"   # Graphite CLI (gt)

# other things i need
warpd https://github.com/rvaiya/warpd
ohmyzsh sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)"
Roboto Mono Font and configure ghostty, cursor, vscode to use it

# work
graphite
